Repository: CofficLab/Lumi
Catalog: Packages/PluginDatabaseManager/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Refresh Structure
zh_hans: 刷新结构
zh_hk: 刷新结构

source: Default
zh_hans: 默认
zh_hk: 默认

source: Position
zh_hans: 位置
zh_hk: 位置

source: Remove Change
zh_hans: 移除更改
zh_hk: 移除更改

# Index Type
source: Type
zh_hans: 类型
zh_hk: 类型

source: Undo
zh_hans: 撤销
zh_hk: 撤销

source: Redo
zh_hans: 重做
zh_hk: 重做

source: Prev
zh_hans: 上一页
zh_hk: 上一页

source: Next
zh_hans: 下一页
zh_hk: 下一页

source: My Database
zh_hans: 我的数据库
zh_hk: 我的数据库

source: %lld structure changes
zh_hans: %lld 处结构更改
zh_hk: %lld 处结构更改

source: Add Column
zh_hans: 添加列
zh_hk: 添加列

source: Add Connection
zh_hans: 添加连接
zh_hk: 添加連接

source: Add Index
zh_hans: 添加索引
zh_hk: 添加索引

source: Add Row
zh_hans: 添加行
zh_hk: 添加行

source: Allow NULL
zh_hans: 允许 NULL
zh_hk: 允许 NULL

source: Apply Changes
zh_hans: 应用更改
zh_hk: 应用更改

source: Apply Structure Changes
zh_hans: 应用结构更改
zh_hk: 应用结构更改

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Choose a table from the sidebar to view its data.
zh_hans: 从侧边栏选择一张表以查看其数据。
zh_hk: 从侧边栏选择一张表以查看其数据。

source: Clear All
zh_hans: 清空全部
zh_hk: 清空全部

source: Click + to add a new connection.
zh_hans: 点击 + 添加新连接。
zh_hk: 按 + 新增連線。

source: Click Reload to refresh the key list.
zh_hans: 点击「重新加载」刷新键列表。
zh_hk: 点击「重新加载」刷新键列表。

source: Click Reload to refresh the object list.
zh_hans: 点击「重新加载」刷新对象列表。
zh_hk: 点击「重新加载」刷新对象列表。

source: Close
zh_hans: 关闭
zh_hk: 关闭

source: Columns
zh_hans: 列
zh_hk: 列

source: Connection Name
zh_hans: 连接名称
zh_hk: 连接名称

source: Connection succeeded
zh_hans: 连接成功
zh_hk: 连接成功

source: Connections
zh_hans: 连接
zh_hk: 连接

source: Copy
zh_hans: 复制
zh_hk: 复制

source: Copy All
zh_hans: 全部复制
zh_hk: 全部复制

source: Copy DDL
zh_hans: 复制 DDL
zh_hk: 复制 DDL

source: Data Type
zh_hans: 数据类型
zh_hk: 数据类型

source: Database
zh_hans: 数据库
zh_hk: 資料庫

source: Database Connections
zh_hans: 数据库连接
zh_hk: 資料庫連線

source: Database Path
zh_hans: 数据库路径
zh_hk: 数据库路径

source: Database Type
zh_hans: 数据库类型
zh_hk: 数据库类型

source: DDL is not available for this object.
zh_hans: 该对象不可用 DDL。
zh_hk: 该对象不可用 DDL。

source: Default SQL Expression
zh_hans: 默认 SQL 表达式
zh_hk: 默认 SQL 表达式

source: Delete
zh_hans: 删除
zh_hk: 刪除

source: Delete Row
zh_hans: 删除行
zh_hk: 删除行

source: deletes
zh_hans: 处删除
zh_hk: 处删除

source: Discard
zh_hans: 放弃
zh_hk: 放弃

source: Disconnect
zh_hans: 断开连接
zh_hk: 斷開連線

source: Drop Column…
zh_hans: 删除列…
zh_hk: 删除列…

source: Drop Index…
zh_hans: 删除索引…
zh_hk: 删除索引…

source: Edit
zh_hans: 编辑
zh_hk: 编辑

source: Edit Connection
zh_hans: 编辑连接
zh_hk: 编辑连接

source: edits
zh_hans: 处编辑
zh_hk: 处编辑

source: entries
zh_hans: 条
zh_hk: 条

source: Executed queries will appear here.
zh_hans: 已执行的查询将显示在此处。
zh_hk: 已执行的查询将显示在此处。

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面說明

source: Filter objects
zh_hans: 筛选对象
zh_hk: 筛选对象

source: History
zh_hans: 历史
zh_hk: 历史

source: Host
zh_hans: 主机
zh_hk: 主机

source: In Connections, click + to add a connection, fill in the database type, name, and password, then save and connect.
zh_hans: 在「连接」中点击 + 添加连接,填写数据库类型、名称和密码后保存并连接。
zh_hk: 在「連線」中點擊 + 新增連線,填寫資料庫類型、名稱和密碼後儲存並連線。

source: Index Name
zh_hans: 索引名称
zh_hk: 索引名称

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: just now
zh_hans: 刚刚
zh_hk: 刚刚

source: Keys
zh_hans: 键
zh_hk: 键

source: Leave blank to keep current
zh_hans: 留空以保留当前值
zh_hk: 留空以保留当前值

source: Leave the password field empty when editing a connection to keep the saved password.
zh_hans: 编辑连接时密码留空,即可保留原来保存的密码。
zh_hk: 編輯連線時密碼留空,即可保留原來保存的密碼。

source: Load into Editor
zh_hans: 载入编辑器
zh_hk: 载入编辑器

source: Loading structure…
zh_hans: 加载结构…
zh_hk: 加载结构…

source: Loading…
zh_hans: 加载中…
zh_hk: 加载中…

source: Main area: the SQL editor with Run All and History buttons, the query results below, and an inspector for table structure.
zh_hans: 主区域:SQL 编辑器(带「全部运行」和「历史」按钮)、下方的查询结果,以及表结构检查器。
zh_hk: 主區域:SQL 編輯器(帶「全部執行」和「歷史」按鈕)、下方的查詢結果,以及資料表結構檢查器。

source: Multi-Database Support
zh_hans: 多数据库支持
zh_hk: 多資料庫支援

source: Name
zh_hans: 名称
zh_hk: 名称

source: new
zh_hans: 新建
zh_hk: 新建

source: No changes
zh_hans: 无更改
zh_hk: 无更改

source: No Database Connected
zh_hans: 未连接数据库
zh_hk: 未连接数据库

source: No database connected
zh_hans: 未连接数据库
zh_hk: 未连接数据库

source: No history
zh_hans: 无历史
zh_hk: 无历史

source: No items
zh_hans: 无项目
zh_hk: 无项目

source: No keys
zh_hans: 无键
zh_hk: 无键

source: No objects
zh_hans: 无对象
zh_hk: 无对象

source: No pending changes
zh_hans: 无待定更改
zh_hk: 无待定更改

source: No results
zh_hans: 无结果
zh_hk: 無結果

source: No saved connections
zh_hans: 暂无已保存的连接
zh_hk: 尚無已儲存的連線

source: No Structure Available
zh_hans: 无可用结构
zh_hk: 无可用结构

source: No tables
zh_hans: 无表
zh_hk: 无表

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: OK
zh_hans: 确定
zh_hk: 确定

source: Open
zh_hans: 打开
zh_hk: 打开

source: Open a table or view to inspect its structure.
zh_hans: 打开表或视图以查看其结构。
zh_hk: 打开表或视图以查看其结构。

source: Open History to review previously run SQL.
zh_hans: 打开「历史」查看之前运行过的 SQL。
zh_hk: 開啟「歷史」查看之前執行過的 SQL。

source: Open the Database tab in the sidebar.
zh_hans: 在侧边栏中打开「数据库」。
zh_hk: 在側邊欄中開啟「資料庫」。

source: Overview
zh_hans: 概述
zh_hk: 概述

source: Page
zh_hans: 页
zh_hk: 页

source: Page Size
zh_hans: 每页大小
zh_hk: 每页大小

source: Password
zh_hans: 密码
zh_hk: 密码

source: Pending Changes
zh_hans: 待定更改
zh_hk: 待定更改

source: Pick a saved connection below, or add a new one to get started.
zh_hans: 在下方选择一个已保存的连接，或新建一个连接以开始。
zh_hk: 在下方选择一个已保存的连接，或新建一个连接以开始。

source: Port
zh_hans: 端口
zh_hk: 端口

source: Preview DDL
zh_hans: 预览 DDL
zh_hk: 预览 DDL

source: Preview SQL
zh_hans: 预览 SQL
zh_hk: 预览 SQL

source: Query History
zh_hans: 查询历史
zh_hk: 查询历史

source: Refresh
zh_hans: 刷新
zh_hk: 刷新

source: Reload
zh_hans: 刷新
zh_hk: 重新整理

source: Remove Row
zh_hans: 删除行
zh_hk: 删除行

source: Rename Column
zh_hans: 重命名列
zh_hk: 重命名列

source: Rename…
zh_hans: 重命名…
zh_hk: 重命名…

source: Results
zh_hans: 结果区
zh_hk: 結果區

source: Review the generated DDL before changing the database.
zh_hans: 修改数据库前，请先查看生成的 DDL。
zh_hk: 修改数据库前，请先查看生成的 DDL。

source: Review write operations carefully before running them; some changes cannot be undone.
zh_hans: 执行写操作前请仔细确认,部分更改无法撤销。
zh_hk: 執行寫入操作前請仔細確認,部分變更無法復原。

source: rows
zh_hans: 行
zh_hk: 行

source: Rows
zh_hans: 行
zh_hk: 行

source: Run
zh_hans: 运行
zh_hk: 运行

source: Run All
zh_hans: 全部运行
zh_hk: 全部运行

source: Save
zh_hans: 保存
zh_hk: 保存

source: Save Changes
zh_hans: 保存更改
zh_hk: 保存更改

source: Saved Connections
zh_hans: 已保存的连接
zh_hk: 已保存的连接

source: Search history
zh_hans: 搜索历史
zh_hk: 搜索历史

source: Select a database to connect
zh_hans: 选择要连接的数据库
zh_hk: 选择要连接的数据库

source: Select a table
zh_hans: 选择表
zh_hk: 选择表

source: Set NULL
zh_hans: 设为 NULL
zh_hk: 设为 NULL

source: Show Connections
zh_hans: 显示连接
zh_hk: 顯示連線

source: Show Tables
zh_hans: 显示表
zh_hk: 顯示資料表

source: Sidebar
zh_hans: 侧边栏
zh_hk: 側邊欄

source: Sidebar: two modes via the switch at the top. Connections lists saved connections; Tables shows the object tree of the connected database with a filter.
zh_hans: 侧边栏:通过顶部切换在两种模式间切换。「连接」列出已保存的连接,「表」显示所连数据库的对象树并支持筛选。
zh_hk: 側邊欄:透過頂部切換在兩種模式間切換。「連線」列出已保存的連線,「表」顯示所連資料庫的物件樹並支援篩選。

source: Some database engines auto-commit DDL statements.
zh_hans: 部分数据库引擎会自动提交 DDL 语句。
zh_hk: 部分数据库引擎会自动提交 DDL 语句。

source: SQL editor
zh_hans: SQL 编辑区
zh_hk: SQL 編輯區

source: Stage Column
zh_hans: 暂存列
zh_hk: 暂存列

source: Stage Index
zh_hans: 暂存索引
zh_hk: 暂存索引

source: Stage Rename
zh_hans: 暂存重命名
zh_hk: 暂存重命名

source: Structure
zh_hans: 结构
zh_hk: 结构

source: Structure Change Error
zh_hans: 结构更改错误
zh_hk: 结构更改错误

source: Structure Section
zh_hans: 结构分区
zh_hk: 结构分区

source: Switch to Connections above to add or pick a database.
zh_hans: 通过顶部的切换按钮进入连接面板以添加或选择数据库。
zh_hk: 可從上方切換到連線面板新增或選擇資料庫。

source: Switch to Tables to browse the object tree and inspect a table's structure.
zh_hans: 切换到「表」,浏览对象树并查看数据表结构。
zh_hk: 切換到「表」,瀏覽物件樹並查看資料表結構。

source: Tables
zh_hans: 表
zh_hk: 表

source: Test Connection
zh_hans: 测试连接
zh_hk: 测试连接

source: This change drops data and cannot be undone by Lumi.
zh_hans: 此更改会丢弃数据，且无法由 Lumi 撤销。
zh_hk: 此更改会丢弃数据，且无法由 Lumi 撤销。

source: This manual covers the interface and basic operations of the Database Manager: managing connections, browsing tables, and running SQL.
zh_hans: 本手册介绍「数据库」的界面与基本操作:管理连接、浏览数据表、编写并运行 SQL。
zh_hk: 本手冊介紹「資料庫」的介面與基本操作:管理連線、瀏覽資料表、撰寫並執行 SQL。

source: Toggle
zh_hans: 切换
zh_hk: 切換

source: Toggle Inspector
zh_hans: 切换检查器
zh_hk: 切换检查器

source: Unable to Load Structure
zh_hans: 无法加载结构
zh_hk: 无法加载结构

source: Undelete Row
zh_hans: 恢复删除的行
zh_hk: 恢复删除的行

source: Unique Index
zh_hans: 唯一索引
zh_hk: 唯一索引

source: unsaved
zh_hans: 未保存
zh_hk: 未保存

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: Username
zh_hans: 用户名
zh_hk: 用户名

source: Write SQL in the editor and click Run All; the results appear below.
zh_hans: 在编辑器中编写 SQL,点击「全部运行」,结果显示在下方。
zh_hk: 在編輯器中撰寫 SQL,點擊「全部執行」,結果顯示在下方。
